UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d31edcfb-c254-4df6-813c-45d97556c9a4">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>саУНФ_СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДоставки</name>
    <type>
      <types>CatalogRef.ЗоныТарифыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>GEOКоординаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="578aaecc-aed2-4ef8-88f9-128a6e803783">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="adb6110c-e022-4572-88ef-65dd4952fcbe">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a66e61d-1e1f-42eb-84c7-96c67491221a">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd18fe57-8dac-4f41-ba14-ab79115be357">
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83abc3c8-5d30-4200-9b3c-c098e93d9dd4">
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="def7c5d9-841f-49c8-a2ab-a11c7b524370">
    <name>НомерТелефонаДляПоиска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ID_ЛК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6a614d71-f1bf-4633-927f-fd1ab375a540">
    <name>ВидКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbfd1e4e-302d-4158-a36e-7de2ee52275f">
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="76421bdf-3553-4920-b9b2-b9cca25e740f">
    <name>ВестиРасчетыПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d913c699-9b21-4f70-9e25-e7cd66899b35">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФИОДиректора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="7bfdd4f5-ffe7-4ecb-b402-405a8f1c112a">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0256d9ee-2e46-491e-949b-274e47734717">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b53e5f38-6df7-47fc-b690-eb2dee6eb3ca">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dcd2476a-e93e-4236-a2fd-6b93ca54afa7">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d59d1b80-7147-4bb8-ace4-61a0365415ad">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="39ac5143-3bca-4b85-8057-40fdbc360b37">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>id_adress</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/Контрагенты/ObjectModule.bsl
Функция КонтрагентЯвляетсяГоловным(КонтрагентСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
	Запрос.Текст = "Выбрать Первые 1 Истина Из Справочник.Контрагенты КАК СпрКонтрагенты Где СпрКонтрагенты.ГоловнойКонтрагент = &КонтрагентСсылка";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	ЯвляетсяГоловным = НЕ РезультатЗапроса.Пустой();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЯвляетсяГоловным
	
КонецФункции



&После("ПередЗаписью")
Процедура саУНФ_ПередЗаписью2(Отказ)
	Если ЭтотОбъект.ЭтоГруппа Тогда
	 Возврат;
	КонецЕсли; 
	Если  ЗначениеЗаполнено(ЭтотОбъект.Недействителен)И ЭтотОбъект.Недействителен  Тогда
      Возврат;
    КонецЕсли;

  
	ТаблицаКИ=УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЭтотОбъект,Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагета,,Ложь);
	
	ОМ_УА = ОбщегоНазначения.ОбщийМодуль("саУНФ_Bitrix");
	Если НЕ ОМ_УА =Неопределено Тогда
		Если ТипЗнч(ТаблицаКИ) = Тип("ТаблицаЗначений") Тогда
			Если ТаблицаКИ.Количество() > 0 Тогда
				ТекЗапись = ТаблицаКИ[0];
				АдресВСвободнойФорме = Истина;
				Если ЛЕВ(СОКРЛП(ТекЗапись.Значение),1)="{" Тогда
					АдресВСвободнойФорме = УправлениеКонтактнойИнформацией.АдресВведенВСвободнойФорме(ТекЗапись.Значение);
					Если НЕ АдресВСвободнойФорме И ЗначениеЗаполнено(ТекЗапись.Представление) Тогда
						ЗаписьGEOКоординаты=ОМ_УА.ЗапросКоординатПоАдресу(ТекЗапись.Представление);
						Если ЗначениеЗаполнено(ЗаписьGEOКоординаты) Тогда
							GEOКоординаты = ЗаписьGEOКоординаты;
						КонецЕсли;
					КонецЕсли;    
				КонецЕсли; 
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

	Для каждого СтрКИ Из ЭтотОбъект.КонтактнаяИнформация Цикл
		Если НЕ ЗначениеЗаполнено(СтрКИ.id_adress) Тогда
			СтрКИ.id_adress = Новый УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла; 
		
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		ИНН =СОКРЛП(ИНН);
		
		Если СтранаРегистрации=Справочники.СтраныМира.ПустаяСсылка() ИЛИ 
			СтранаРегистрации=Справочники.СтраныМира.Россия ИЛИ
			СтранаРегистрации.Код ="112" Тогда
			
			
			
			Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИНН);
			Если  Не Результат Тогда
				ОбщегоНазначения.СообщитьПользователю("В УНП должны быть только цифры");
				Отказ = Истина;
			КонецЕсли; 
			
			Если  СтранаРегистрации=Справочники.СтраныМира.Россия Тогда
				Если  СтрДлина(ИНН)<>10 Тогда
					ОбщегоНазначения.СообщитьПользователю("В Российском ИНН должны быть 10 цифр");
					Отказ = Истина;
				КонецЕсли;
			Иначе
				Если  СтрДлина(ИНН)<>9 Тогда
					ОбщегоНазначения.СообщитьПользователю("В УНП должны быть 9 цифр");
					Отказ = Истина;
				КонецЕсли;	
			КонецЕсли;
			
			
			Если  ЭтоНовый() Тогда
			ЭтоГоловняк=Ложь;	
			Иначе	
			ЭтоГоловняк=КонтрагентЯвляетсяГоловным(Ссылка);
			КонецЕсли;
			
			Если НЕ ЭтоГоловняк Тогда
				
				Если  ЗначениеЗаполнено(ГоловнойКонтрагент) Тогда
					СсыльНаГоловняка =   ГоловнойКонтрагент;
				Иначе	
					СсыльНаГоловняка = Неопределено;
				КонецЕсли; 	
				
				Если  ЭтоНовый() Тогда
					ЕстьКонтрагент= саУНФ_Bitrix.ПроверитьСуществуетЛиКонтрагентВБазе(ИНН,СсыльНаГоловняка);
				Иначе	
					ЕстьКонтрагент= саУНФ_Bitrix.ПроверитьСуществуетЛиКонтрагентВБазе(ИНН,СсыльНаГоловняка,Ссылка);
				КонецЕсли; 
				
				Если НЕ ЕстьКонтрагент = Неопределено Тогда
					ОбщегоНазначения.СообщитьПользователю("Контрагент с УНП " + СТРОКА(ИНН)+" уже есть в базе");
					Отказ = Истина;
				КонецЕсли; 
				
			КонецЕсли; 	
				
	КонецЕсли; 
		
	КонецЕсли; 	
КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура саУНФ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если  Недействителен Тогда
            ПроверяемыеРеквизиты.Очистить();
	КонецЕсли; 
КонецПроцедуры

&После("ПриЗаписи")
Процедура саУНФ_ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры
